
/************************************************************************************/
/*     程序名：16x16点阵试验程序          							                */
/*                                                                                  */
/*     CPU型号：AT89S52/STC89C51RC    晶振：12.0 M                                  */
/*                                                                                  */                                             
/*                                                                                  */
/*     功能描述： 控制16x16LED点阵显示图形字母汉字等                                */
/*     行  扫    ： 74ls138x2 CPU P1口前四位 A P1^0	 B  P1^1  C  P1^2   D  P1^3	   	*/
/*     列扫（数据）：SCK P0^0 RCK P0^1 SER P0^2                                     */
/*     取模方式：    阳码 逐行式  逆向（低位在前）                                        								    */
/*																				    */
/*                                                      精英团队 版权所有           */                                 
/*                                                            2008-06-20            */
/************************************************************************************/ 

#include<reg52.h>
#define uchar unsigned char
#define uint unsigned int 
 


sbit  P_HC595_SCK  =  P0^0;        // CPU  pin 1       SCK        数据输入时钟
sbit  P_HC595_RCK  =  P0^1;        // CPU  pin 2       RCK        数据输出时钟
sbit  P_HC595_SER  =  P0^2;        // CPU  pin 3        SER       数据输入


uint  yanshi=1;


uchar code table[]=
{0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09,0x0a,0x0b,0x0c,0x0d,0x0e,0x0f};

uchar code table_col[]=
{0x80,0x00, 0x40,0x00, 0x20,0x00, 0x10,0x00, 0x08,0x00, 0x04,0x00, 0x02,0x00, 0x01,0x00, 0x00,0x80, 0x00,0x40,0x00,0x20,0x00,0x10,0x00,0x08,0x00,0x04,0x00,0x02,0x00,0x01};





 

void delay(uint x)                      //延时子函数
{	
	uint i,j;
	for(i=x;i>0;i--)
	   for(j=10;j>0;j--);
}


 

void Send_595(unsigned char dat)        //发送一个字节
{                
        unsigned char  i;
        for(i=0; i<8; i++)
        {
                if(dat & 0x01)           //如果dat和0x01与的结果是1，也就是需要led亮，就把数据位置0， 
  
//  0000 0000 0000 1000
//  0000 0000 0000 0001
//  0000 0000 0000 0000
//  需要右移
//  第一位获取的是0，由于是阴码 0 时led是不亮的，根据595的工作原理和电路原理，送的数据应该为 1 ，送到第四位时，与的结果为1，，数据送 0 。

				   P_HC595_SER = 0;	    //数据是 0 时，led 亮
               else                		
				   P_HC595_SER = 1;	   //数据是 1  时，led不亮		    
                
			// P_HC595_SER  =  dat & 0x80 ;   //取出最高位
				
				
				P_HC595_SCK = 0;
				P_HC595_SCK = 1;

                dat = dat >> 1;		//右移1位
			 

        }

	
}

void Show_595_16(unsigned char dat1,dat2)  //显示一行


{

       Send_595(dat2);	  // 送一行的高位数据
	   Send_595(dat1);	  // 送一行的低位数据
	  	   				  
	  

	   P_HC595_RCK = 1;	  //数据锁存高电平

	   P_HC595_RCK = 0;	  //数据锁存低电平

	    delay(10);
	    

}

void Show_595_clear()  //清屏

{

    unsigned char j ;

	for (j=0;j<16;j++)
    {
	   P1=table[j];//查表显示数字

	   	   
	   Send_595(0x00);	  // 送一行的高位数据
	   Send_595(0x00);	  // 送一行的低位数据
	  	   				  
	   
	   P_HC595_RCK = 1;	  //数据锁存高电平

	   P_HC595_RCK = 0;	  //数据锁存低电平


	   delay(1);		  //延时

	     
	 }

}      

    




/*****************************************************/
/*    函数功能：								     */
/*    在第 坐标为第y行，第x列的交点处画一个点		 */
/*													 */
/*													 */
/*													 */
/*													 */
/*													 */
/*****************************************************/

  
 
void Show_595_point(uint x,y)   

{

 P1 = table[y];

 Show_595_16(table_col[2*x],table_col[2*x+1]);




}


/*****************************************************/
/*    函数功能：								     */
/*    在第 y 行从x1到x2之间画一条水平线段             */
/*													 */
/*													 */
/*													 */
/*													 */
/*													 */
/*****************************************************/



void Show_595_line(uchar x1,x2,y)  //显示一条直线段

{
	  unsigned char  i;
       
	  
	   P1 = table[y];
	   
       
	   for(i=x1;i<x2+1;i++)

	  {
        
	   	   
	   Show_595_16(table_col[2*i],table_col[2*i+1]);
	   
	   
	   
	   }



}

 
/*****************************************************/
/*    函数功能：					                 */
/*    在第 y 行从x1到x2之间画一条竖直直线段           */
/*													 */
/*													 */
/*													 */
/*													 */
/*													 */
/*****************************************************/



void Show_595_yline(uchar x,y1,y2)  //显示一条竖直直线段

{
	  unsigned char  i;

	  
	  Show_595_16(table_col[2*x],table_col[2*x+1]);

             
	   for(i=y1;i<(y2+1);i++)

	  {
        
	   	   
	   P1 = table[i];
	   
	   
	   
	   }



}



void Show_595_xline(uchar x1,y1,x2,y2)  //画一条起点坐标为（x1,y1）终点坐标为（x2，y2）的斜线段

{
	  unsigned char  i;

	  for(i=x1;i<x2+1;i++)

       {
	   
	   	Show_595_point(i,((y2-y1)*i/(x2-x1)+(y1*x2-y2*x1)/(x2-x1))); 
		
		 
	   }

	  

             
	    


}
 

  void main()
{	
 

 while(1) {  
 			unsigned char  i,j;

			
			
			for (i=15;i>0;i--)
 
 
            { 	 for (j=0;j<2;j++)
			
			      {Show_595_xline(0,15,15,i);}
			  
            }


				for (i=15;i>0;i--)
 
 
            { 	 for (j=0;j<2;j++)
			
			      {Show_595_xline(0,15,i,0);}
			  
            }
		   	
/*		     
			 for (i=0;i<16;i++)
 
 
            { 	 for (j=0;j<2;j++)
			
			      {Show_595_xline(0,15,i,0);}
			  
            }


			 	for (i=0;i<16;i++)
 
 
            { 	 for (j=0;j<2;j++)
			
			      {Show_595_xline(0,15,15,i);}
			  
            }

*/

/////////////////////////////////////////////////////////////////////////////		 
		   	
			 	for (i=0;i<16;i++)
 
 
            { 	 for (j=0;j<2;j++)
			
			      {Show_595_xline(0,i,15,15);}
			  
            }


				for (i=0;i<16;i++)
 
 
            { 	 for (j=0;j<2;j++)
			
			      {Show_595_xline(0,i,15,0);}
			  
            }
		   	
		     
			for (i=0;i<16;i++)
 
 
            { 	 for (j=0;j<2;j++)
			
			      {Show_595_xline(0,0,i,15);}
			  
            }  
		 
		   	

		     


			 

		
		}
  


         

}





 

